<?php

return [
    /*
    |------------------------------------------------------------------
    | Регистрация
    |------------------------------------------------------------------
    */
    'registration' => [
        'email_confirm' => env('ACCOUNT_EMAIL_CONFIRM', true),   // Подтверждение по e-mail
        'phone_confirm' => env('ACCOUNT_PHONE_CONFIRM', false),  // Подтверждение по телефону
    ],

    /*
    |------------------------------------------------------------------
    | Авторизация
    |------------------------------------------------------------------
    */
    'login' => [
        'max_login_attempts' => 5,   // Разрешенное количество попыток авторизации
        'lockout_time' => 300,   // Время, на которое блокируется пользователь в секундах
    ],
    'debug' => env('ACCOUNT_DEBUG', true)
];
